<a href="https://colab.research.google.com/github/roshanc10/Practice_References/blob/main/pylibraries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
x = 5
id(x)

94521032862336

In [44]:
basic_information = {"name":['karl','Lary'],"mobile":["0134567894","0123456789"]}
academic_information = {"grade":["A","B"]}

In [45]:
basic_information.update(academic_information)

basic_information

{'grade': ['A', 'B'],
 'mobile': ['0134567894', '0123456789'],
 'name': ['karl', 'Lary']}

In [47]:
x= "12.5"
x

'12.5'

In [49]:
import datetime
x=datetime.datetime(2021,7,18)
print(x)

2021-07-18 00:00:00

In [50]:
from datetime import date

date.today()

datetime.date(2021, 7, 18)

In [51]:
date.today().month

7

In [52]:
from datetime import datetime,timedelta
today = datetime.now()
dateafter = today+ timedelta(days=90)
print(dateafter)

print(today.isoweekday())
today.weekday()

2021-10-16 11:45:29.992964
7

6

In [ ]:
import re
check = "roshan is best"
print(re.search('[ros]',check))

print(re.search('^r',check))
print(re.search('n$',check))

print(re.findall('ro',check)) #occurance in the string
print(re.split('\s',check))   #split by spaces
print(re.sub('\s','1',check)) #replace space with 1

<re.Match object; span=(0, 1), match='r'>
<re.Match object; span=(0, 1), match='r'>
None
['ro']
['roshan', 'is', 'best']
roshan1is1best

In [ ]:
Data science libraries

In [ ]:
import numpy as np
arr = np.array((2,5,6,7,1))
arr

list(arr)

[2, 5, 6, 7, 1]

In [ ]:
#2d array

arr2 = np.array([[5,6,3],[6,3,2]])
arr2
arr2[0,2]

3

In [ ]:
np.zeros([2,2])

array([[0., 0.],
       [0., 0.]])

In [3]:
import pandas as pd
import numpy as np
#df1 = pd.read_csv("file.csv")

times= pd.date_range('1/1/2021',periods=20)

df =pd.DataFrame(np.random.randn(20,5)    #20 rows and 5 cols
                ,index=times,columns=['col1','col2','col3','col4','col5'])

print(df.head(5))

col11 = df['col1']
print('\n',col11[times][2])

df.loc[1]={'col1':25}
print(df)

df.loc['2021-01-02 00:00:00']={'col1':25}
print(df)

                col1      col2      col3      col4      col5
2021-01-01  0.793780 -2.053115  0.424863  0.604804 -1.331134
2021-01-02  0.847651  0.426390 -1.187145 -1.738974  1.546755
2021-01-03 -0.356243 -3.151382  0.177113 -0.282486  0.888761
2021-01-04 -0.943406  1.261423  0.107696 -0.530942 -0.134889
2021-01-05  1.054270  1.585187  1.838446  0.850039 -0.006740

 -0.356242521988678
                          col1      col2      col3      col4      col5
2021-01-01 00:00:00   0.793780 -2.053115  0.424863  0.604804 -1.331134
2021-01-02 00:00:00   0.847651  0.426390 -1.187145 -1.738974  1.546755
2021-01-03 00:00:00  -0.356243 -3.151382  0.177113 -0.282486  0.888761
2021-01-04 00:00:00  -0.943406  1.261423  0.107696 -0.530942 -0.134889
2021-01-05 00:00:00   1.054270  1.585187  1.838446  0.850039 -0.006740
2021-01-06 00:00:00  -0.623075 -0.736304  0.043422 -0.954604 -0.404079
2021-01-07 00:00:00   0.683792  2.328492 -0.235471  0.400234 -1.862937
2021-01-08 00:00:00  -0.091034 -0.462305  0.929604 -0.742934 -0.040046
2021-01-09 00:00:00  -3.757104 -0.669424  1.150779 -0.409751 -0.609192
2021-01-10 00:00:00  -2.496511 -1.731809  0.203946  0.642842  1.820832
2021-01-11 00:00:00   0.219443  1.651634 -1.058349  0.638734 -1.595269
2021-01-12 00:00:00  -0.351371 -0.119302  0.305094  1.993701 -1.070817
2021-01-13 00:00:00  -1.290209 -1.693618 -0.188845  0.011335  1.854473
2021-01-14 00:00:00   1.643681  0.416073 -1.605280 -2.472798 -0.282259
2021-01-15 00:00:00  -0.015051  1.338066 -0.076049 -0.296104  1.579164
2021-01-16 00:00:00   0.055108 -0.008332  0.154160 -0.248038 -0.556118
2021-01-17 00:00:00  -0.215403 -0.305471  0.266350  1.589259 -2.426009
2021-01-18 00:00:00  -1.149982  0.046580 -0.355187 -0.198145  1.713707
2021-01-19 00:00:00   0.053494 -1.322154 -0.445090  1.295624 -0.048043
2021-01-20 00:00:00   0.849404 -0.020833  1.371405  1.163118  1.055830
1                    25.000000       NaN       NaN       NaN       NaN
                          col1      col2      col3      col4      col5
2021-01-01 00:00:00   0.793780 -2.053115  0.424863  0.604804 -1.331134
2021-01-02 00:00:00   0.847651  0.426390 -1.187145 -1.738974  1.546755
2021-01-03 00:00:00  -0.356243 -3.151382  0.177113 -0.282486  0.888761
2021-01-04 00:00:00  -0.943406  1.261423  0.107696 -0.530942 -0.134889
2021-01-05 00:00:00   1.054270  1.585187  1.838446  0.850039 -0.006740
2021-01-06 00:00:00  -0.623075 -0.736304  0.043422 -0.954604 -0.404079
2021-01-07 00:00:00   0.683792  2.328492 -0.235471  0.400234 -1.862937
2021-01-08 00:00:00  -0.091034 -0.462305  0.929604 -0.742934 -0.040046
2021-01-09 00:00:00  -3.757104 -0.669424  1.150779 -0.409751 -0.609192
2021-01-10 00:00:00  -2.496511 -1.731809  0.203946  0.642842  1.820832
2021-01-11 00:00:00   0.219443  1.651634 -1.058349  0.638734 -1.595269
2021-01-12 00:00:00  -0.351371 -0.119302  0.305094  1.993701 -1.070817
2021-01-13 00:00:00  -1.290209 -1.693618 -0.188845  0.011335  1.854473
2021-01-14 00:00:00   1.643681  0.416073 -1.605280 -2.472798 -0.282259
2021-01-15 00:00:00  -0.015051  1.338066 -0.076049 -0.296104  1.579164
2021-01-16 00:00:00   0.055108 -0.008332  0.154160 -0.248038 -0.556118
2021-01-17 00:00:00  -0.215403 -0.305471  0.266350  1.589259 -2.426009
2021-01-18 00:00:00  -1.149982  0.046580 -0.355187 -0.198145  1.713707
2021-01-19 00:00:00   0.053494 -1.322154 -0.445090  1.295624 -0.048043
2021-01-20 00:00:00   0.849404 -0.020833  1.371405  1.163118  1.055830
1                    25.000000       NaN       NaN       NaN       NaN
2021-01-02 00:00:00  25.000000       NaN       NaN       NaN       NaN

In [ ]:
df.iloc[:5,0:3]   #5rows 3 cols

                         col1      col2      col3
2021-01-01 00:00:00  1.245400  0.110717  0.985290
2021-01-02 00:00:00 -2.144633 -1.966523 -0.078144
2021-01-03 00:00:00 -0.755768 -1.312136  1.039454
2021-01-04 00:00:00 -0.518187 -1.413763  0.755654
2021-01-05 00:00:00 -0.015972  0.301429 -1.959318

In [ ]:
df[(df['col1']<0)]

                         col1      col2      col3      col4      col5
2021-01-02 00:00:00 -2.144633 -1.966523 -0.078144  0.296244 -1.838758
2021-01-03 00:00:00 -0.755768 -1.312136  1.039454 -0.831825  0.804142
2021-01-04 00:00:00 -0.518187 -1.413763  0.755654  0.634150 -0.020635
2021-01-05 00:00:00 -0.015972  0.301429 -1.959318 -1.419003 -1.023850
2021-01-06 00:00:00 -0.991457 -1.321988 -0.114607 -0.042245  0.629888
2021-01-07 00:00:00 -0.077408 -2.196594  1.110179 -1.259179  0.664689
2021-01-11 00:00:00 -0.118900 -0.021945 -1.699266  0.013404 -1.552223
2021-01-12 00:00:00 -0.975976  0.876439  0.310406  0.667538 -0.403991
2021-01-13 00:00:00 -1.512641  0.128558 -1.690443  1.157229  0.730890
2021-01-15 00:00:00 -3.052919  2.346407 -1.211939 -0.606219 -0.250960
2021-01-18 00:00:00 -1.016851  0.462344  0.284765  0.032196 -0.551012
2021-01-19 00:00:00 -0.626508 -0.826471 -1.098271 -0.180922 -0.473814

In [ ]:
df[(df['col1']<0) & (df['col2']>0)][['col3','col4']]

                         col3      col4
2021-01-05 00:00:00 -1.959318 -1.419003
2021-01-12 00:00:00  0.310406  0.667538
2021-01-13 00:00:00 -1.690443  1.157229
2021-01-15 00:00:00 -1.211939 -0.606219
2021-01-18 00:00:00  0.284765  0.032196

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

joins(left,right,inner,outer)

In [ ]:
#cust = pd.merge(df1,df2,on='ord_id',how='inner')
#df = pd.concat([df1,df2],axis = 0)  0 for row 1 for cols

Map fn works with series to perform and operation

apply fn work with dataframe  . can also be used with lambda function

from_items is used to create df out of dict

In [ ]:
def fndiv(x):
  return x/10

df['usertime'] = df['usertime'].map(fndiv)
print(df['usertime'])

print(df[['usertime','User ID']].apply(fndiv))

print(df['usertime'].apply(lambda x:x*2))

0       0.355223
1       0.162517
2       0.480321
3       0.251573
4       0.061040
          ...
1031    0.081151
1032    0.000777
1033    0.026954
1034    0.012355
1035    0.128446
Name: usertime, Length: 1036, dtype: float64
      usertime  User ID
0     0.035522     56.7
1     0.016252    177.7
2     0.048032    177.8
3     0.025157    178.0
4     0.006104    178.1
...        ...      ...
1031  0.008115    325.8
1032  0.000078    325.9
1033  0.002695    326.0
1034  0.001236    326.1
1035  0.012845    326.2

[1036 rows x 2 columns]
0       0.710447
1       0.325035
2       0.960642
3       0.503145
4       0.122080
          ...
1031    0.162302
1032    0.001554
1033    0.053908
1034    0.024710
1035    0.256892
Name: usertime, Length: 1036, dtype: float64

In [ ]:
basic_information = {"name":['karl','Lary'],"mobile":["0134567894","0123456789"]}
print(basic_information)

df2 = pd.DataFrame.from_dict(basic_information)
df2

{'name': ['karl', 'Lary'], 'mobile': ['0134567894', '0123456789']}

   name      mobile
0  karl  0134567894
1  Lary  0123456789

In [ ]:
import pandas as pd
from collections import OrderedDict
from datetime import date

sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df = pd.DataFrame(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

As you can see, this approach is very “row oriented”. If you would like to create a DataFrame in a “column oriented” manner, you would use from_dict

In [ ]:
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
dfd = pd.DataFrame.from_dict(sales)
dfd

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

The other option for creating your DataFrames from python is to include the data in a list structure.

The first approach is to use a row oriented approach using pandas from_records . This approach is similar to the dictionary approach but you need to explicitly call out the column labels.

In [ ]:
sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
dfl = pd.DataFrame.from_records(sales, columns=labels)
dfl

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

missing values
MCAR(missing completely at random), MAR(missing at random),MNAR(missing not at random)

1.if the column has high corelation with the target column

2.if the removal of row or col can lead to information loss

Fill NA with Mean, Median or Mode of the data
Fill NA with a constant value
Forward Fill or Backward Fill NA (method='ffill','bfill')
Interpolate Data and Fill NA

In [34]:
df = pd.read_excel('/content/sample_data/Sample Data.xlsx')
print(df.columns)
df

Index(['User ID', 'Session Count', 'Uninstall Date', 'usertime', 'Share Count',
       'Notification Receive', 'Notification Dismiss', 'Notification Open',
       'Acquired Medium google / others', 'Reg at date', 'CIty ',
       'Video Count', 'Quiz Count'],
      dtype='object')

      User ID  Session Count Uninstall Date  ...   CIty   Video Count  Quiz Count
0         567            4.0     2019-01-07  ...     NaN            0           0
1        1777           16.0     2018-10-05  ...     NaN            5          13
2        1778          401.0     2019-03-08  ...  Mumbai           28          38
3        1780          226.0     2019-08-28  ...  Mumbai           49          87
4        1781           14.0     2018-09-14  ...     NaN            4           8
...       ...            ...            ...  ...     ...          ...         ...
1031     3258            9.0     2019-02-06  ...     NaN           28          69
1032     3259            NaN     2018-11-19  ...     NaN            0           0
1033     3260           21.0            NaT  ...  Mumbai            7           4
1034     3261            1.0            NaT  ...     NaN            6           3
1035     3262           60.0     2019-01-08  ...     NaN           28          39

[1036 rows x 13 columns]

In [41]:
df.shape

(1036, 13)

In [40]:
df.isnull().sum(axis=1).sort_values(ascending= False)
df.isnull().sum()

User ID                            0
Session Count                      0
Uninstall Date                     0
usertime                           0
Share Count                        0
Notification Receive               0
Notification Dismiss               0
Notification Open                  0
Acquired Medium google / others    0
Reg at date                        0
CIty                               0
Video Count                        0
Quiz Count                         0
dtype: int64

for categorical use mode i.e most no of occurances , else median and mean

In [36]:
df['CIty '].fillna('NA',inplace=True)
#city is replaces with NA
#mode with highest no of occurances
df['Uninstall Date'] = df['Uninstall Date'].fillna(df['Uninstall Date'].mode()[0])
df['Reg at date'] = df['Reg at date'].fillna(df['Reg at date'].mode()[0])

#df.replace(to_replace = np.nan, value = -99) 

df

      User ID  Session Count Uninstall Date  ...   CIty   Video Count  Quiz Count
0         567            4.0     2019-01-07  ...      NA            0           0
1        1777           16.0     2018-10-05  ...      NA            5          13
2        1778          401.0     2019-03-08  ...  Mumbai           28          38
3        1780          226.0     2019-08-28  ...  Mumbai           49          87
4        1781           14.0     2018-09-14  ...      NA            4           8
...       ...            ...            ...  ...     ...          ...         ...
1031     3258            9.0     2019-02-06  ...      NA           28          69
1032     3259            NaN     2018-11-19  ...      NA            0           0
1033     3260           21.0     2019-01-12  ...  Mumbai            7           4
1034     3261            1.0     2019-01-12  ...      NA            6           3
1035     3262           60.0     2019-01-08  ...      NA           28          39

[1036 rows x 13 columns]

In [37]:
# Using median
df['Share Count'].fillna(df['Share Count'].median(), inplace=True)
df['usertime'].fillna(df['usertime'].median(), inplace=True)


# Using mean
df['Session Count'].fillna(int(df['Session Count'].mean()), inplace=True)
df['Notification Open'].fillna(int(df['Notification Open'].mean()), inplace=True)
df['Notification Dismiss'].fillna(int(df['Notification Dismiss'].mean()), inplace=True)
df['Notification Receive'].fillna(int(df['Notification Receive'].mean()), inplace=True)

df

      User ID  Session Count Uninstall Date  ...   CIty   Video Count  Quiz Count
0         567            4.0     2019-01-07  ...      NA            0           0
1        1777           16.0     2018-10-05  ...      NA            5          13
2        1778          401.0     2019-03-08  ...  Mumbai           28          38
3        1780          226.0     2019-08-28  ...  Mumbai           49          87
4        1781           14.0     2018-09-14  ...      NA            4           8
...       ...            ...            ...  ...     ...          ...         ...
1031     3258            9.0     2019-02-06  ...      NA           28          69
1032     3259           28.0     2018-11-19  ...      NA            0           0
1033     3260           21.0     2019-01-12  ...  Mumbai            7           4
1034     3261            1.0     2019-01-12  ...      NA            6           3
1035     3262           60.0     2019-01-08  ...      NA           28          39

[1036 rows x 13 columns]

In [39]:
df.isnull().sum().sum()

0